* McDowell (2020) 14W
:PROPERTIES:
:header-args:jupyter-python+: :session ds :kernel ds
:clearpage: t
:END:

#+BEGIN_SRC bash :results verbatim :exports results
cat meta.bsv | sed 's/|/@| /' | column -s"@" -t
#+END_SRC

#+RESULTS:
#+begin_example
Name                                  | mcdowell_2021_14w
Alternate name                        | 
Data source                           |  McDowell, I. E., Humphrey, N. F., Harper, J. T., and Meierbachtol, T. W.: The cooling signature of basal crevasses in a hard-bedded region of the Greenland Ice Sheet, The Cryosphere, 15, 897–907, https://doi.org/10.5194/tc-15-897-2021, 2021.
Drill year(s)                         | 2014
Data year(s)                          | August 2015
Longitude [°E]                        | -49.57478802
Latitude [°N]                         | 67.18201398
Approximate location name             | 
Location source                       | 
Ice thickness [m]                     | 661
Ice thickness year                    | 2014
Ice thickness source                  | See raw data file `Greenland_AblationZone_TProfiles.xlsx` in 14n folder
Surface velocity [m yr^-1]            | 
Surface velocity year                 | 
Surface velocity source               | 
Measured from: Top, Bottom, Relative  | B
Depth of top measurement [m]          | 40
Depth of bottom measurement [m]       | 660
#+end_example

** Temperature

+ Provided by Ian McDowell (see raw data file `Greenland_AblationZone_TProfiles.xlsx` in 14n folder)

** Thickness

+ Provided by Ian McDowell (see raw data file `Greenland_AblationZone_TProfiles.xlsx` in 14n folder)
 
** Location

+ Provided by Ian McDowell (see raw data file `Greenland_AblationZone_TProfiles.xlsx` in 14n folder)

** Velocity

** Data                                                 :noexport:

#+BEGIN_SRC python :exports none
import numpy as np
import pandas as pd

df_bot = pd.read_csv("meta.bsv", sep="|", index_col=0, header=None, squeeze=True)
thick = np.float(df_bot['Ice thickness [m]'])
df = pd.read_csv('data_bottom.csv')
df = df[df.columns[::-1]]  # swap from d,t to t,d
df['d'] = thick - df['d']
df.to_csv('data.csv', index=False)
#+END_SRC

#+RESULTS:
: None

#+BEGIN_SRC bash :exports results
cat data.csv | sort -t, -n -k2
#+END_SRC

#+RESULTS:
|                   t |     d |
|      -10.9641274792 |  40.0 |
| -11.227441218800001 |  60.0 |
| -11.490754958399998 |  80.0 |
|       -11.691568698 | 100.0 |
|      -11.9548824376 | 120.0 |
| -11.843196177200001 | 140.0 |
|      -11.9190099168 | 160.0 |
| -11.869823656400001 | 180.0 |
| -11.883137395999999 | 200.0 |
|      -11.7714511356 | 220.0 |
|      -11.7222648752 | 240.0 |
|      -11.6105786148 | 260.0 |
|      -11.4988923544 | 280.0 |
| -11.387206094000001 | 300.0 |
| -11.150519833599999 | 320.0 |
|      -10.9763335732 | 340.0 |
| -10.864647312799999 | 360.0 |
|      -10.5029610524 | 380.0 |
|       -10.078774792 | 400.0 |
|       -9.5295885316 | 420.0 |
|  -9.042902271200001 | 440.0 |
|       -8.4937160108 | 460.0 |
|  -7.882029750399999 | 480.0 |
|         -7.14534349 | 500.0 |
|  -6.839500359800001 | 510.0 |
|       -6.4086572296 | 520.0 |
|  -6.040314099400001 | 530.0 |
|  -5.609470969199999 | 540.0 |
|        -5.116127839 | 550.0 |
|       -4.6852847088 | 560.0 |
|       -4.1919415786 | 570.0 |
|       -3.7610984484 | 580.0 |
|       -3.2677553182 | 590.0 |
| -2.8994121880000003 | 600.0 |
|       -2.4060690578 | 610.0 |
|       -1.9127259276 | 620.0 |
| -1.4193827974000002 | 630.0 |
|       -1.1760396672 | 640.0 |
|        -0.682696537 | 650.0 |
|       -0.5018534068 | 660.0 |

